### Carregando base de dados

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('../../dados/census.csv')
df.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [10]:
df_2  = df[['income', 'education']]
df_2.head()

   income   education
0   <=50K   Bachelors
1   <=50K   Bachelors
2   <=50K     HS-grad
3   <=50K        11th
4   <=50K   Bachelors

In [11]:
df_3 = df_2.groupby(['education','income'])['education'].count()

In [12]:
df_3

education      income
 10th           <=50K     871
                >50K       62
 11th           <=50K    1115
                >50K       60
 12th           <=50K     400
                >50K       33
 1st-4th        <=50K     162
                >50K        6
 5th-6th        <=50K     317
                >50K       16
 7th-8th        <=50K     606
                >50K       40
 9th            <=50K     487
                >50K       27
 Assoc-acdm     <=50K     802
                >50K      265
 Assoc-voc      <=50K    1021
                >50K      361
 Bachelors      <=50K    3134
                >50K     2221
 Doctorate      <=50K     107
                >50K      306
 HS-grad        <=50K    8826
                >50K     1675
 Masters        <=50K     764
                >50K      959
 Preschool      <=50K      51
 Prof-school    <=50K     153
                >50K      423
 Some-college   <=50K    5904
                >50K     1387
Name: education, dtype: int64

In [13]:
df_3.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [16]:
df_3[' Bachelors', ' <=50K'], df_3[' Bachelors', ' >50K']

(3134, 2221)

In [17]:
3134 + 2221

5355

In [18]:
3134 / 5355

0.5852474323062559

In [19]:
2221 / 5355

0.4147525676937442

### Coeficientes e Taxas

In [29]:
dados = {'Ano graduação' : ['1', '2', '3', '4', 'total'],
        'Matrículas março': [70,50,47,23, 190],
        'Matrículas novembro' : [65,48,40,22, 175]}

In [30]:
df_ct = pd.DataFrame(dados)
df_ct

  Ano graduação  Matrículas março  Matrículas novembro
0             1                70                   65
1             2                50                   48
2             3                47                   40
3             4                23                   22
4         total               190                  175

In [31]:
df_ct['Taxa de evasão'] = ((df_ct['Matrículas março'] - df_ct['Matrículas novembro']) / df_ct['Matrículas março']) * 100

In [32]:
df_ct

  Ano graduação  Matrículas março  Matrículas novembro  Taxa de evasão
0             1                70                   65        7.142857
1             2                50                   48        4.000000
2             3                47                   40       14.893617
3             4                23                   22        4.347826
4         total               190                  175        7.894737